
 ## Pair Pandas y Dataframes
 
Momento de trabajar con Series. Contesta a las siguientes preguntas:

Crea dos listas:

Una que se llame "valores" que tenga 7 números aleatorios.

Otra que se llame "indices" que tenga 7 strings que se llamen como los días de la semana.

A partir de estas dos listas crea una Serie donde la variable "valores" sean los valores de la Serie y la variable indices sean los índices de la Serie.

A partir de las dos listas anteriores crea un diccionario usando un bucle for. Para hacer esto tenemos el método zip que nos permite iterar por dos listas a la vez. Más informción sobre este método aquí.

Crea una Serie con el diccionario creado en el punto anterior.

¿Qué forma tiene esta última Serie?

¿Qué tipo de datos tiene?

¿Qué tamaño tiene?

¿Cuáles son los índices de la Serie?

¿Y los values?

Extrae el valor para el índice "lunes"

Extrae el valor para el índice "lunes", "martes" y "miércoles".

Extrae el valor para el índice "lunes" y "domingo".

Es el turno de los DataFrames

Crea un array de dos dimensiones con 4 filas y 3 columnas.

Convierte el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".

Descarga el archivo "medallas" y carga el DataFrame.

Usando el loc extrae todas las columnas de la fila de Tailandia.

Usando el loc extrae todas las columnas de China e Irán.

Usando el loc extrae solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.

Usando el iloc extrae la información de la India. Devolved todas las columnas.

Usando el iloc extrae todas las columnas de los paises que estén en posición impar. La primera que nos tendría que salir es Japón y la última Corea del Norte.

Utilizando el código del ejercicio anterior, selecciona unicamente las columnas "Oro", "Plata" y "Bronce".

Contesta a las siguientes preguntas:

¿Qué país consiguió más de 200 medallas de oro?

¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?

¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?

Crea una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.

In [1]:
import numpy as np
import pandas as pd

In [3]:
import random

In [4]:
valores = []
for n in range (7):
    numero = random.randint(1, 100)
    valores.append(numero)

print(valores)

[68, 33, 94, 4, 20, 91, 63]

In [8]:
indices = ["lunes", "martes", "miercoles", "jueves","viernes","sabado","domingo"]

In [9]:
serie1 = pd.Series(valores, index =indices)
print(serie1)

lunes        68
martes       33
miercoles    94
jueves        4
viernes      20
sabado       91
domingo      63
dtype: int64

In [10]:
X = zip(indices, valores)

In [12]:
diccionario = dict(X)
diccionario

{'lunes': 68,
 'martes': 33,
 'miercoles': 94,
 'jueves': 4,
 'viernes': 20,
 'sabado': 91,
 'domingo': 63}

In [13]:
serie2 = pd.Series(diccionario)
serie2

lunes        68
martes       33
miercoles    94
jueves        4
viernes      20
sabado       91
domingo      63
dtype: int64

In [14]:
serie2.shape

(7,)

In [15]:
serie2.dtype

dtype('int64')

In [16]:
serie2.size

7

In [17]:
serie2.index

Index(['lunes', 'martes', 'miercoles', 'jueves', 'viernes', 'sabado',
       'domingo'],
      dtype='object')

In [18]:
serie2.values

array([68, 33, 94,  4, 20, 91, 63])

In [19]:
serie2["lunes"]

68

In [21]:
serie2.lunes

68

In [24]:
array1 = np.random.randint(0,100, (4,3))
array1

array([[65, 70,  6],
       [ 4,  1, 98],
       [79, 21, 35],
       [16, 94, 87]])

In [28]:
df = pd.DataFrame(array1, columns= ["España", "Francia","Italia"])
df

   España  Francia  Italia
0      65       70       6
1       4        1      98
2      79       21      35
3      16       94      87

In [43]:
df_medallas = pd.read_csv("medallas.csv", index_col=0)

In [44]:
df_medallas

               País   Oro  Plata  Bronce
1             China  1473    994     720
2             Japón  1032   1037     985
3     Corea del Sur   745    663     827
4              Irán   179    181     197
5        Kazajistán   155    158     224
6             India   154    202     315
7         Tailandia   132    175     278
8         Indonesia   112    131     240
9      China Taipéi    99    144     276
10  Corea del Norte    91    120     235

In [46]:
df_medallas.loc[7]

País      Tailandia
Oro             132
Plata           175
Bronce          278
Name: 7, dtype: object

In [49]:
df_medallas.loc[4:9:5]

           País  Oro  Plata  Bronce
4          Irán  179    181     197
9  China Taipéi   99    144     276

In [54]:
df_medallas.loc[[4,9]]

           País  Oro  Plata  Bronce
4          Irán  179    181     197
9  China Taipéi   99    144     276

In [55]:
df_medallas.loc[[4,9],"Oro":"Bronce"]

   Oro  Plata  Bronce
4  179    181     197
9   99    144     276

In [73]:
df_medallas[df_medallas.Oro > 200]

            País   Oro  Plata  Bronce
1          China  1473    994     720
2          Japón  1032   1037     985
3  Corea del Sur   745    663     827

In [63]:
df_medallas.Oro

1     1473
2     1032
3      745
4      179
5      155
6      154
7      132
8      112
9       99
10      91
Name: Oro, dtype: int64